In [1]:
import pandas as pd

In [2]:
dfA = pd.DataFrame([
        {'nama': 'Andi', 'matematika':90, 'bahasa':80},
        {'nama': 'Andi', 'matematika':95, 'bahasa':83},
        {'nama': 'Andi', 'matematika':92,'bahasa':80},
        {'nama': 'Odang', 'matematika':90, 'bahasa':81},
        {'nama': 'Odang', 'matematika':84, 'bahasa':80},
        {'nama': 'Odang', 'matematika':88, 'bahasa':90}
])
dfA

    nama  matematika  bahasa
0   Andi          90      80
1   Andi          95      83
2   Andi          92      80
3  Odang          90      81
4  Odang          84      80
5  Odang          88      90

# GROUPING

In [3]:
dfName = dfA.groupby('nama')
dfName.groups.keys()

dict_keys(['Andi', 'Odang'])

In [4]:
dfName.get_group('Andi')

   nama  matematika  bahasa
0  Andi          90      80
1  Andi          95      83
2  Andi          92      80

In [5]:
#Group By
# dfName.get_group('Andi').max()['bahasa']

#Ordinary Data Frame
dfA[dfA['nama']=='Andi']['bahasa'].max()

83

In [6]:
dfName.get_group('Odang')

    nama  matematika  bahasa
3  Odang          90      81
4  Odang          84      80
5  Odang          88      90

In [7]:
dfName.mean()

       matematika     bahasa
nama
Andi    92.333333  81.000000
Odang   87.333333  83.666667

# CONCAT

In [8]:
dfA = pd.DataFrame([
        {'nama': 'Rudi', 'matematika':90, 'bahasa':80},
        {'nama': 'Rudi', 'matematika':95, 'bahasa':83},
        {'nama': 'Rudi', 'matematika':92,'bahasa':80},
])
dfB = pd.DataFrame([
        {'nama': 'Wowor', 'matematika':90, 'bahasa':81},
        {'nama': 'Wowor', 'matematika':84, 'bahasa':80},
        {'nama': 'Wowor', 'matematika':88, 'bahasa':90}
])
dfAB = pd.concat([dfA,dfB])
dfAB

    nama  matematika  bahasa
0   Rudi          90      80
1   Rudi          95      83
2   Rudi          92      80
0  Wowor          90      81
1  Wowor          84      80
2  Wowor          88      90

In [9]:
dfC = pd.concat([dfA,dfB], axis=1)
dfC

   nama  matematika  bahasa   nama  matematika  bahasa
0  Rudi          90      80  Wowor          90      81
1  Rudi          95      83  Wowor          84      80
2  Rudi          92      80  Wowor          88      90

In [10]:
dfD = pd.concat([dfA,dfB], ignore_index=True)
dfD

    nama  matematika  bahasa
0   Rudi          90      80
1   Rudi          95      83
2   Rudi          92      80
3  Wowor          90      81
4  Wowor          84      80
5  Wowor          88      90

In [11]:
dfE = pd.DataFrame([
        {'nama': 'Rudi', 'matematika':90, 'bahasa':80},
        {'nama': 'Rudi', 'matematika':95, 'bahasa':83},
        {'nama': 'Rudi', 'matematika':92,'bahasa':80},
])
dfF = pd.DataFrame([
        {'nama': 'Wowor', 'fisika':90, 'bahasa':81},
        {'nama': 'Wowor', 'fisika':84, 'bahasa':80},
        {'nama': 'Wowor', 'fisika':88, 'bahasa':90}
])
dfEF = pd.concat([dfE,dfF], ignore_index=True, sort=False)
dfEF

    nama  matematika  bahasa  fisika
0   Rudi        90.0      80     NaN
1   Rudi        95.0      83     NaN
2   Rudi        92.0      80     NaN
3  Wowor         NaN      81    90.0
4  Wowor         NaN      80    84.0
5  Wowor         NaN      90    88.0

In [21]:
dfI = pd.DataFrame([
        {'nama': 'Rudi', 'matematika':90, 'bahasa':80},
        {'nama': 'Wowor', 'matematika':95, 'bahasa':83},
        {'nama': 'Harun', 'matematika':92,'bahasa':80},
], index = [0,1,2])
dfJ = pd.DataFrame([
        {'nama': 'Harun', 'fisika':90, 'bahasa':81},
        {'nama': 'Wowor', 'fisika':84, 'bahasa':80},
        {'nama': 'Rudi', 'fisika':88, 'bahasa':90}
], index = [2,1,0])
dfIJ = pd.concat([dfI,dfJ], ignore_index=True, sort=False, axis=1)
dfIJ

       0   1   2      3   4   5
0   Rudi  90  80   Rudi  88  90
1  Wowor  95  83  Wowor  84  80
2  Harun  92  80  Harun  90  81

In [13]:
# dfG = pd.DataFrame([
#         {'nama': 'Rudi', 'matematika':90, 'bahasa':80},
#         {'nama': 'Wowor', 'matematika':95, 'bahasa':83},
#         {'nama': 'Harun', 'matematika':92,'bahasa':80},
# ])
# dfH = pd.DataFrame([
#         {'nama': 'Harun', 'fisika':90, 'bahasa':81},
#         {'nama': 'Wowor', 'fisika':84, 'bahasa':80},
#         {'nama': 'Rudi', 'fisika':88, 'bahasa':90}
# ])
# dfGH = pd.concat([dfG,dfH], ignore_index=True, sort=False, axis=1)
# dfGH

# MERGING

In [30]:
dfK = pd.DataFrame([
        {'nama': 'Rudi', 'matematika':90, 'bahasa':80},
        {'nama': 'Wowor', 'matematika':95, 'bahasa':83},
        {'nama': 'Harun', 'matematika':92,'bahasa':80},
])
dfL = pd.DataFrame([
        {'nama': 'Harun', 'fisika':90, 'bahasa':81},
        {'nama': 'Wowor', 'fisika':84, 'bahasa':80},
        {'nama': 'Rudi', 'fisika':88, 'bahasa':90}
])
dfKL = pd.merge(dfK,dfL) 
#on='nama',how='inner')
dfKL

Empty DataFrame
Columns: [nama, matematika, bahasa, fisika]
Index: []

In [24]:
dfM = pd.DataFrame([
        {'nama': 'Rudi', 'matematika':90, 'bahasa':80},
        {'nama': 'Wowor', 'matematika':95, 'bahasa':83},
        {'nama': 'Harun', 'matematika':92,'bahasa':80},
])
dfN = pd.DataFrame([
        {'nama': 'Harun', 'fisika':90, 'bahasa':81},
        {'nama': 'Wowor', 'fisika':84, 'bahasa':80},
        {'nama': 'Rudi', 'fisika':88, 'bahasa':90}
])
dfMN = pd.merge(dfM,dfN,on='nama',how='inner')
dfMN

    nama  matematika  bahasa  fisika  kimia
0   Rudi          90      80      88     90
1  Wowor          95      83      84     80
2  Harun          92      80      90     81

In [32]:
dfO = pd.DataFrame([
        {'nama': 'Rudi', 'matematika':90, 'bahasa':80},
        {'nama': 'Wowor', 'matematika':95, 'bahasa':83},
        {'nama': 'Harun', 'matematika':92,'bahasa':80},
])
dfP = pd.DataFrame([
        {'nama': 'Harun', 'fisika':90, 'kimia':81},
        {'nama': 'Wowor', 'fisika':84, 'kimia':80},
        {'nama': 'Rudi', 'fisika':88, 'kimia':90}
])
dfOP = pd.merge(dfO,dfP) 
#on='nama',how='inner')
dfOP

    nama  matematika  bahasa  fisika  kimia
0   Rudi          90      80      88     90
1  Wowor          95      83      84     80
2  Harun          92      80      90     81

# PIVOT

In [35]:
dfQ = pd.DataFrame([
        {'test':1,'nama': 'Andi', 'matematika':90, 'bahasa':80},
        {'test':2,'nama': 'Andi', 'matematika':95, 'bahasa':83},
        {'test':3,'nama': 'Andi', 'matematika':92,'bahasa':80},
        {'test':1,'nama': 'Odang', 'matematika':90, 'bahasa':81},
        {'test':2,'nama': 'Odang', 'matematika':84, 'bahasa':80},
        {'test':3,'nama': 'Odang', 'matematika':88, 'bahasa':90}
])
dfQ = dfQ.pivot(index='test',columns='nama')
dfQ

     matematika       bahasa
nama       Andi Odang   Andi Odang
test
1            90    90     80    81
2            95    84     83    80
3            92    88     80    90

In [36]:
dfQ.columns

MultiIndex([('matematika',  'Andi'),
            ('matematika', 'Odang'),
            (    'bahasa',  'Andi'),
            (    'bahasa', 'Odang')],
           names=[None, 'nama'])

In [37]:
dfQ.loc[1]

            nama
matematika  Andi     90
            Odang    90
bahasa      Andi     80
            Odang    81
Name: 1, dtype: int64

In [38]:
#Andi Bahasa Test 1
dfQ['bahasa']['Andi'].loc[1]

80

In [39]:
dfQ['bahasa']['Andi'].iloc[0]

80

In [47]:
dfR = pd.DataFrame({
    'mapel': ['biologi','biologi','biologi','fisika','fisika','fisika'],
    'test': [1,2,3,1,2,3],
    'Rambo': [78,89,90,65,99,88],
    'Jambo': [90,77,88,90,75,60]
})
# dfR = dfR.set_index(['test','mapel'])
# dfR

In [49]:
dfR1 = dfR.set_index(['test','mapel']).unstack()
dfR1

        Rambo          Jambo
mapel biologi fisika biologi fisika
test
1          78     65      90     90
2          89     99      77     75
3          90     88      88     60

In [50]:
dfR1.columns

MultiIndex([('Rambo', 'biologi'),
            ('Rambo',  'fisika'),
            ('Jambo', 'biologi'),
            ('Jambo',  'fisika')],
           names=[None, 'mapel'])

In [58]:
#swaplevel (yang mau diubah 1, yang mau diubah 2, axis)
dfR2 = dfR1.swaplevel(0,1,1).sort_index(1)
dfR2

mapel biologi       fisika
        Jambo Rambo  Jambo Rambo
test
1          90    78     90    65
2          77    89     75    99
3          88    90     60    88

In [56]:
dfR2.columns.levels

FrozenList([['biologi', 'fisika'], ['Rambo', 'Jambo']])

In [57]:
dfR2.columns.labels

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: .labels was deprecated in version 0.24.0. Use .codes instead.
  """Entry point for launching an IPython kernel.

FrozenList([[0, 1, 0, 1], [0, 0, 1, 1]])

In [65]:
dfR3 = dfR.set_index(['mapel','test']).unstack()
dfR3

        Rambo         Jambo
test        1   2   3     1   2   3
mapel
biologi    78  89  90    90  77  88
fisika     65  99  88    90  75  60

In [66]:
dfR3.index

Index(['biologi', 'fisika'], dtype='object', name='mapel')